[
  {
    "title": "\"Make it better\" isn't a valid feature proposal",
    "body": "Proposals like \"make it better, faster, or use a better algorithm\" don’t provide actionable information for developers. They’re already committed to improving Blender's performance and features, but without specifics, such posts offer no guidance on **what** to improve or **how** to do it.\n\nDevelopers need concrete, real-world examples of issues:\n\n- What is slow or inefficient?\n- What specific tools, workflows, or processes are problematic?\n- How does it impact your projects or goals?\n\nFor example, instead of saying 'faster simulation,' describe a scenario: 'Fluid simulations with high viscosity take excessively long on 4K meshes; optimizing this could save hours during iterations.'\n\nIf you can’t pinpoint the issue or solution, it’s better to seek community feedback or provide detailed examples rather than post vague requests."
  },
  {
    "title": "\"Make it better\" isn't a valid feature proposal",
    "body": "Proposals like \\\"make it better, faster, or use a better algorithm\\\" are not helpful.| Developers are committed to improving Blender, and anyone in the community wants everything to be better. Vague suggestions without details not only fail to properly explain what* needs improvement or *how* to achieve it or even why it should need a specific focus over another topic; but it also adds noise to the pool of proposals making  potentially good ones harder to gain traction.||To make your voice better heard, you should first verify if the topic was already brought up before, and if not, you could provide concrete examples of issues:|| - What specific aspects of Blender are slow or inefficient?| - Which tools, workflows, or processes cause problems in your work?| - How do these issues impact your productivity or project goals?| For example, instead of just saying \\\"faster simulation,\\\" describe a scenario: \\\"Fluid simulations with high viscosity take excessively long on 4K meshes. Optimizing this could save hours in the iteration process.\\\"|"
  }
]
